CSI API ETABS v1

# cAreaElmGetObj Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetObj(
    	string Name,
    	ref string Obj
    )

    Function GetObj (
    	Name As String,
    	ByRef Obj As String
    ) As Integer

    Dim instance As cAreaElm
    Dim Name As String
    Dim Obj As String
    Dim returnValue As Integer

    returnValue = instance.GetObj(Name, Obj)

    int GetObj(
    	String^ Name,
    	String^% Obj
    )

    abstract GetObj :
            Name : string *
            Obj : string byref -> int

#### Parameters

Name

    Type: SystemString

Obj

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAreaElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com